{"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "NAME_EDUCATION_TYPE_input"}, "name": "NAME_EDUCATION_TYPE_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "NAME_FAMILY_STATUS_input"}, "name": "NAME_FAMILY_STATUS_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "NAME_TYPE_SUITE_input"}, "name": "NAME_TYPE_SUITE_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "NAME_INCOME_TYPE_input"}, "name": "NAME_INCOME_TYPE_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "FLAG_OWN_REALTY_input"}, "name": "FLAG_OWN_REALTY_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "NAME_HOUSING_TYPE_input"}, "name": "NAME_HOUSING_TYPE_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "NAME_CONTRACT_TYPE_input"}, "name": "NAME_CONTRACT_TYPE_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "ORGANIZATION_TYPE_input"}, "name": "ORGANIZATION_TYPE_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "FLAG_OWN_CAR_input"}, "name": "FLAG_OWN_CAR_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "CODE_GENDER_input"}, "name": "CODE_GENDER_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "FLAG_MOBIL_input"}, "name": "FLAG_MOBIL_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "FLAG_EMP_PHONE_input"}, "name": "FLAG_EMP_PHONE_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "FLAG_WORK_PHONE_input"}, "name": "FLAG_WORK_PHONE_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "FLAG_CONT_MOBILE_input"}, "name": "FLAG_CONT_MOBILE_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "FLAG_PHONE_input"}, "name": "FLAG_PHONE_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "FLAG_EMAIL_input"}, "name": "FLAG_EMAIL_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "REGION_RATING_CLIENT_input"}, "name": "REGION_RATING_CLIENT_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "REGION_RATING_CLIENT_W_CITY_input"}, "name": "REGION_RATING_CLIENT_W_CITY_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "REG_REGION_NOT_LIVE_REGION_input"}, "name": "REG_REGION_NOT_LIVE_REGION_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "REG_REGION_NOT_WORK_REGION_input"}, "name": "REG_REGION_NOT_WORK_REGION_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "LIVE_REGION_NOT_WORK_REGION_input"}, "name": "LIVE_REGION_NOT_WORK_REGION_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "REG_CITY_NOT_LIVE_CITY_input"}, "name": "REG_CITY_NOT_LIVE_CITY_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "REG_CITY_NOT_WORK_CITY_input"}, "name": "REG_CITY_NOT_WORK_CITY_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "LIVE_CITY_NOT_WORK_CITY_input"}, "name": "LIVE_CITY_NOT_WORK_CITY_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "FLAG_DOCUMENT_2_input"}, "name": "FLAG_DOCUMENT_2_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "FLAG_DOCUMENT_3_input"}, "name": "FLAG_DOCUMENT_3_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "FLAG_DOCUMENT_4_input"}, "name": "FLAG_DOCUMENT_4_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "FLAG_DOCUMENT_5_input"}, "name": "FLAG_DOCUMENT_5_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "FLAG_DOCUMENT_6_input"}, "name": "FLAG_DOCUMENT_6_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "FLAG_DOCUMENT_7_input"}, "name": "FLAG_DOCUMENT_7_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "FLAG_DOCUMENT_8_input"}, "name": "FLAG_DOCUMENT_8_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "FLAG_DOCUMENT_9_input"}, "name": "FLAG_DOCUMENT_9_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "FLAG_DOCUMENT_10_input"}, "name": "FLAG_DOCUMENT_10_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "FLAG_DOCUMENT_11_input"}, "name": "FLAG_DOCUMENT_11_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "FLAG_DOCUMENT_12_input"}, "name": "FLAG_DOCUMENT_12_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "FLAG_DOCUMENT_13_input"}, "name": "FLAG_DOCUMENT_13_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "FLAG_DOCUMENT_14_input"}, "name": "FLAG_DOCUMENT_14_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "FLAG_DOCUMENT_15_input"}, "name": "FLAG_DOCUMENT_15_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "FLAG_DOCUMENT_16_input"}, "name": "FLAG_DOCUMENT_16_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "FLAG_DOCUMENT_17_input"}, "name": "FLAG_DOCUMENT_17_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "FLAG_DOCUMENT_18_input"}, "name": "FLAG_DOCUMENT_18_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "FLAG_DOCUMENT_19_input"}, "name": "FLAG_DOCUMENT_19_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "FLAG_DOCUMENT_20_input"}, "name": "FLAG_DOCUMENT_20_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "FLAG_DOCUMENT_21_input"}, "name": "FLAG_DOCUMENT_21_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 19, 96], "dtype": "float32", "sparse": false, "ragged": false, "name": "temporal_input"}, "name": "temporal_input", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "embedding", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 5, "output_dim": 36, "embeddings_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding", "inbound_nodes": [[["NAME_EDUCATION_TYPE_input", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 5, "output_dim": 36, "embeddings_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_1", "inbound_nodes": [[["NAME_FAMILY_STATUS_input", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_2", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 7, "output_dim": 36, "embeddings_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_2", "inbound_nodes": [[["NAME_TYPE_SUITE_input", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_3", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 8, "output_dim": 36, "embeddings_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_3", "inbound_nodes": [[["NAME_INCOME_TYPE_input", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_4", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 2, "output_dim": 36, "embeddings_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_4", "inbound_nodes": [[["FLAG_OWN_REALTY_input", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_5", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 6, "output_dim": 36, "embeddings_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_5", "inbound_nodes": [[["NAME_HOUSING_TYPE_input", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_6", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 2, "output_dim": 36, "embeddings_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_6", "inbound_nodes": [[["NAME_CONTRACT_TYPE_input", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_7", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 58, "output_dim": 36, "embeddings_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_7", "inbound_nodes": [[["ORGANIZATION_TYPE_input", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_8", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 2, "output_dim": 36, "embeddings_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_8", "inbound_nodes": [[["FLAG_OWN_CAR_input", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_9", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 36, "embeddings_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_9", "inbound_nodes": [[["CODE_GENDER_input", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_10", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 1, "output_dim": 36, "embeddings_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_10", "inbound_nodes": [[["FLAG_MOBIL_input", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_11", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 2, "output_dim": 36, "embeddings_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_11", "inbound_nodes": [[["FLAG_EMP_PHONE_input", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_12", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 2, "output_dim": 36, "embeddings_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_12", "inbound_nodes": [[["FLAG_WORK_PHONE_input", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_13", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 2, "output_dim": 36, "embeddings_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_13", "inbound_nodes": [[["FLAG_CONT_MOBILE_input", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_14", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 2, "output_dim": 36, "embeddings_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_14", "inbound_nodes": [[["FLAG_PHONE_input", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_15", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 2, "output_dim": 36, "embeddings_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_15", "inbound_nodes": [[["FLAG_EMAIL_input", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_16", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 36, "embeddings_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_16", "inbound_nodes": [[["REGION_RATING_CLIENT_input", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_17", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 36, "embeddings_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_17", "inbound_nodes": [[["REGION_RATING_CLIENT_W_CITY_input", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_18", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 2, "output_dim": 36, "embeddings_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_18", "inbound_nodes": [[["REG_REGION_NOT_LIVE_REGION_input", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_19", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 2, "output_dim": 36, "embeddings_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_19", "inbound_nodes": [[["REG_REGION_NOT_WORK_REGION_input", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_20", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 2, "output_dim": 36, "embeddings_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_20", "inbound_nodes": [[["LIVE_REGION_NOT_WORK_REGION_input", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_21", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 2, "output_dim": 36, "embeddings_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_21", "inbound_nodes": [[["REG_CITY_NOT_LIVE_CITY_input", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_22", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 2, "output_dim": 36, "embeddings_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_22", "inbound_nodes": [[["REG_CITY_NOT_WORK_CITY_input", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_23", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 2, "output_dim": 36, "embeddings_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_23", "inbound_nodes": [[["LIVE_CITY_NOT_WORK_CITY_input", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_24", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 2, "output_dim": 36, "embeddings_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_24", "inbound_nodes": [[["FLAG_DOCUMENT_2_input", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_25", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 2, "output_dim": 36, "embeddings_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_25", "inbound_nodes": [[["FLAG_DOCUMENT_3_input", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_26", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 2, "output_dim": 36, "embeddings_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_26", "inbound_nodes": [[["FLAG_DOCUMENT_4_input", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_27", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 2, "output_dim": 36, "embeddings_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_27", "inbound_nodes": [[["FLAG_DOCUMENT_5_input", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_28", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 2, "output_dim": 36, "embeddings_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_28", "inbound_nodes": [[["FLAG_DOCUMENT_6_input", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_29", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 2, "output_dim": 36, "embeddings_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_29", "inbound_nodes": [[["FLAG_DOCUMENT_7_input", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_30", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 2, "output_dim": 36, "embeddings_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_30", "inbound_nodes": [[["FLAG_DOCUMENT_8_input", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_31", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 2, "output_dim": 36, "embeddings_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_31", "inbound_nodes": [[["FLAG_DOCUMENT_9_input", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_32", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 2, "output_dim": 36, "embeddings_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_32", "inbound_nodes": [[["FLAG_DOCUMENT_10_input", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_33", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 2, "output_dim": 36, "embeddings_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_33", "inbound_nodes": [[["FLAG_DOCUMENT_11_input", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_34", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 2, "output_dim": 36, "embeddings_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_34", "inbound_nodes": [[["FLAG_DOCUMENT_12_input", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_35", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 2, "output_dim": 36, "embeddings_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_35", "inbound_nodes": [[["FLAG_DOCUMENT_13_input", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_36", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 2, "output_dim": 36, "embeddings_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_36", "inbound_nodes": [[["FLAG_DOCUMENT_14_input", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_37", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 2, "output_dim": 36, "embeddings_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_37", "inbound_nodes": [[["FLAG_DOCUMENT_15_input", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_38", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 2, "output_dim": 36, "embeddings_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_38", "inbound_nodes": [[["FLAG_DOCUMENT_16_input", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_39", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 2, "output_dim": 36, "embeddings_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_39", "inbound_nodes": [[["FLAG_DOCUMENT_17_input", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_40", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 2, "output_dim": 36, "embeddings_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_40", "inbound_nodes": [[["FLAG_DOCUMENT_18_input", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_41", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 2, "output_dim": 36, "embeddings_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_41", "inbound_nodes": [[["FLAG_DOCUMENT_19_input", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_42", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 2, "output_dim": 36, "embeddings_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_42", "inbound_nodes": [[["FLAG_DOCUMENT_20_input", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_43", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 2, "output_dim": 36, "embeddings_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_43", "inbound_nodes": [[["FLAG_DOCUMENT_21_input", 0, 0, {}]]]}, {"class_name": "Masking", "config": {"name": "masking", "trainable": true, "dtype": "float32", "mask_value": 0.0}, "name": "masking", "inbound_nodes": [[["temporal_input", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape", "trainable": true, "dtype": "float32", "target_shape": [36]}, "name": "reshape", "inbound_nodes": [[["embedding", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "dtype": "float32", "target_shape": [36]}, "name": "reshape_1", "inbound_nodes": [[["embedding_1", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_2", "trainable": true, "dtype": "float32", "target_shape": [36]}, "name": "reshape_2", "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_3", "trainable": true, "dtype": "float32", "target_shape": [36]}, "name": "reshape_3", "inbound_nodes": [[["embedding_3", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_4", "trainable": true, "dtype": "float32", "target_shape": [36]}, "name": "reshape_4", "inbound_nodes": [[["embedding_4", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_5", "trainable": true, "dtype": "float32", "target_shape": [36]}, "name": "reshape_5", "inbound_nodes": [[["embedding_5", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_6", "trainable": true, "dtype": "float32", "target_shape": [36]}, "name": "reshape_6", "inbound_nodes": [[["embedding_6", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_7", "trainable": true, "dtype": "float32", "target_shape": [36]}, "name": "reshape_7", "inbound_nodes": [[["embedding_7", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_8", "trainable": true, "dtype": "float32", "target_shape": [36]}, "name": "reshape_8", "inbound_nodes": [[["embedding_8", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_9", "trainable": true, "dtype": "float32", "target_shape": [36]}, "name": "reshape_9", "inbound_nodes": [[["embedding_9", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_10", "trainable": true, "dtype": "float32", "target_shape": [36]}, "name": "reshape_10", "inbound_nodes": [[["embedding_10", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_11", "trainable": true, "dtype": "float32", "target_shape": [36]}, "name": "reshape_11", "inbound_nodes": [[["embedding_11", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_12", "trainable": true, "dtype": "float32", "target_shape": [36]}, "name": "reshape_12", "inbound_nodes": [[["embedding_12", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_13", "trainable": true, "dtype": "float32", "target_shape": [36]}, "name": "reshape_13", "inbound_nodes": [[["embedding_13", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_14", "trainable": true, "dtype": "float32", "target_shape": [36]}, "name": "reshape_14", "inbound_nodes": [[["embedding_14", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_15", "trainable": true, "dtype": "float32", "target_shape": [36]}, "name": "reshape_15", "inbound_nodes": [[["embedding_15", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_16", "trainable": true, "dtype": "float32", "target_shape": [36]}, "name": "reshape_16", "inbound_nodes": [[["embedding_16", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_17", "trainable": true, "dtype": "float32", "target_shape": [36]}, "name": "reshape_17", "inbound_nodes": [[["embedding_17", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_18", "trainable": true, "dtype": "float32", "target_shape": [36]}, "name": "reshape_18", "inbound_nodes": [[["embedding_18", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_19", "trainable": true, "dtype": "float32", "target_shape": [36]}, "name": "reshape_19", "inbound_nodes": [[["embedding_19", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_20", "trainable": true, "dtype": "float32", "target_shape": [36]}, "name": "reshape_20", "inbound_nodes": [[["embedding_20", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_21", "trainable": true, "dtype": "float32", "target_shape": [36]}, "name": "reshape_21", "inbound_nodes": [[["embedding_21", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_22", "trainable": true, "dtype": "float32", "target_shape": [36]}, "name": "reshape_22", "inbound_nodes": [[["embedding_22", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_23", "trainable": true, "dtype": "float32", "target_shape": [36]}, "name": "reshape_23", "inbound_nodes": [[["embedding_23", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_24", "trainable": true, "dtype": "float32", "target_shape": [36]}, "name": "reshape_24", "inbound_nodes": [[["embedding_24", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_25", "trainable": true, "dtype": "float32", "target_shape": [36]}, "name": "reshape_25", "inbound_nodes": [[["embedding_25", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_26", "trainable": true, "dtype": "float32", "target_shape": [36]}, "name": "reshape_26", "inbound_nodes": [[["embedding_26", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_27", "trainable": true, "dtype": "float32", "target_shape": [36]}, "name": "reshape_27", "inbound_nodes": [[["embedding_27", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_28", "trainable": true, "dtype": "float32", "target_shape": [36]}, "name": "reshape_28", "inbound_nodes": [[["embedding_28", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_29", "trainable": true, "dtype": "float32", "target_shape": [36]}, "name": "reshape_29", "inbound_nodes": [[["embedding_29", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_30", "trainable": true, "dtype": "float32", "target_shape": [36]}, "name": "reshape_30", "inbound_nodes": [[["embedding_30", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_31", "trainable": true, "dtype": "float32", "target_shape": [36]}, "name": "reshape_31", "inbound_nodes": [[["embedding_31", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_32", "trainable": true, "dtype": "float32", "target_shape": [36]}, "name": "reshape_32", "inbound_nodes": [[["embedding_32", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_33", "trainable": true, "dtype": "float32", "target_shape": [36]}, "name": "reshape_33", "inbound_nodes": [[["embedding_33", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_34", "trainable": true, "dtype": "float32", "target_shape": [36]}, "name": "reshape_34", "inbound_nodes": [[["embedding_34", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_35", "trainable": true, "dtype": "float32", "target_shape": [36]}, "name": "reshape_35", "inbound_nodes": [[["embedding_35", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_36", "trainable": true, "dtype": "float32", "target_shape": [36]}, "name": "reshape_36", "inbound_nodes": [[["embedding_36", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_37", "trainable": true, "dtype": "float32", "target_shape": [36]}, "name": "reshape_37", "inbound_nodes": [[["embedding_37", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_38", "trainable": true, "dtype": "float32", "target_shape": [36]}, "name": "reshape_38", "inbound_nodes": [[["embedding_38", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_39", "trainable": true, "dtype": "float32", "target_shape": [36]}, "name": "reshape_39", "inbound_nodes": [[["embedding_39", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_40", "trainable": true, "dtype": "float32", "target_shape": [36]}, "name": "reshape_40", "inbound_nodes": [[["embedding_40", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_41", "trainable": true, "dtype": "float32", "target_shape": [36]}, "name": "reshape_41", "inbound_nodes": [[["embedding_41", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_42", "trainable": true, "dtype": "float32", "target_shape": [36]}, "name": "reshape_42", "inbound_nodes": [[["embedding_42", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_43", "trainable": true, "dtype": "float32", "target_shape": [36]}, "name": "reshape_43", "inbound_nodes": [[["embedding_43", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 127], "dtype": "float32", "sparse": false, "ragged": false, "name": "num_input"}, "name": "num_input", "inbound_nodes": []}, {"class_name": "LSTM", "config": {"name": "lstm", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 19, "activation": "relu", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "name": "lstm", "inbound_nodes": [[["masking", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate", "inbound_nodes": [[["reshape", 0, 0, {}], ["reshape_1", 0, 0, {}], ["reshape_2", 0, 0, {}], ["reshape_3", 0, 0, {}], ["reshape_4", 0, 0, {}], ["reshape_5", 0, 0, {}], ["reshape_6", 0, 0, {}], ["reshape_7", 0, 0, {}], ["reshape_8", 0, 0, {}], ["reshape_9", 0, 0, {}], ["reshape_10", 0, 0, {}], ["reshape_11", 0, 0, {}], ["reshape_12", 0, 0, {}], ["reshape_13", 0, 0, {}], ["reshape_14", 0, 0, {}], ["reshape_15", 0, 0, {}], ["reshape_16", 0, 0, {}], ["reshape_17", 0, 0, {}], ["reshape_18", 0, 0, {}], ["reshape_19", 0, 0, {}], ["reshape_20", 0, 0, {}], ["reshape_21", 0, 0, {}], ["reshape_22", 0, 0, {}], ["reshape_23", 0, 0, {}], ["reshape_24", 0, 0, {}], ["reshape_25", 0, 0, {}], ["reshape_26", 0, 0, {}], ["reshape_27", 0, 0, {}], ["reshape_28", 0, 0, {}], ["reshape_29", 0, 0, {}], ["reshape_30", 0, 0, {}], ["reshape_31", 0, 0, {}], ["reshape_32", 0, 0, {}], ["reshape_33", 0, 0, {}], ["reshape_34", 0, 0, {}], ["reshape_35", 0, 0, {}], ["reshape_36", 0, 0, {}], ["reshape_37", 0, 0, {}], ["reshape_38", 0, 0, {}], ["reshape_39", 0, 0, {}], ["reshape_40", 0, 0, {}], ["reshape_41", 0, 0, {}], ["reshape_42", 0, 0, {}], ["reshape_43", 0, 0, {}], ["num_input", 0, 0, {}], ["lstm", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 865, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["concatenate", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization", "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 432, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1", "inbound_nodes": [[["batch_normalization", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_2", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}], "input_layers": [["NAME_EDUCATION_TYPE_input", 0, 0], ["NAME_FAMILY_STATUS_input", 0, 0], ["NAME_TYPE_SUITE_input", 0, 0], ["NAME_INCOME_TYPE_input", 0, 0], ["FLAG_OWN_REALTY_input", 0, 0], ["NAME_HOUSING_TYPE_input", 0, 0], ["NAME_CONTRACT_TYPE_input", 0, 0], ["ORGANIZATION_TYPE_input", 0, 0], ["FLAG_OWN_CAR_input", 0, 0], ["CODE_GENDER_input", 0, 0], ["FLAG_MOBIL_input", 0, 0], ["FLAG_EMP_PHONE_input", 0, 0], ["FLAG_WORK_PHONE_input", 0, 0], ["FLAG_CONT_MOBILE_input", 0, 0], ["FLAG_PHONE_input", 0, 0], ["FLAG_EMAIL_input", 0, 0], ["REGION_RATING_CLIENT_input", 0, 0], ["REGION_RATING_CLIENT_W_CITY_input", 0, 0], ["REG_REGION_NOT_LIVE_REGION_input", 0, 0], ["REG_REGION_NOT_WORK_REGION_input", 0, 0], ["LIVE_REGION_NOT_WORK_REGION_input", 0, 0], ["REG_CITY_NOT_LIVE_CITY_input", 0, 0], ["REG_CITY_NOT_WORK_CITY_input", 0, 0], ["LIVE_CITY_NOT_WORK_CITY_input", 0, 0], ["FLAG_DOCUMENT_2_input", 0, 0], ["FLAG_DOCUMENT_3_input", 0, 0], ["FLAG_DOCUMENT_4_input", 0, 0], ["FLAG_DOCUMENT_5_input", 0, 0], ["FLAG_DOCUMENT_6_input", 0, 0], ["FLAG_DOCUMENT_7_input", 0, 0], ["FLAG_DOCUMENT_8_input", 0, 0], ["FLAG_DOCUMENT_9_input", 0, 0], ["FLAG_DOCUMENT_10_input", 0, 0], ["FLAG_DOCUMENT_11_input", 0, 0], ["FLAG_DOCUMENT_12_input", 0, 0], ["FLAG_DOCUMENT_13_input", 0, 0], ["FLAG_DOCUMENT_14_input", 0, 0], ["FLAG_DOCUMENT_15_input", 0, 0], ["FLAG_DOCUMENT_16_input", 0, 0], ["FLAG_DOCUMENT_17_input", 0, 0], ["FLAG_DOCUMENT_18_input", 0, 0], ["FLAG_DOCUMENT_19_input", 0, 0], ["FLAG_DOCUMENT_20_input", 0, 0], ["FLAG_DOCUMENT_21_input", 0, 0], ["num_input", 0, 0], ["temporal_input", 0, 0]], "output_layers": [["dense_2", 0, 0]]}, "keras_version": "2.4.0", "backend": "tensorflow"}